balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GB210.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR18" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR18" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0x3f" edc:name="U1RXR" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0x3f" edc:name="U1CTSR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXR0" edc:desc="" edc:mask="0x1" edc:name="U1RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR1" edc:desc="" edc:mask="0x1" edc:name="U1RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR2" edc:desc="" edc:mask="0x1" edc:name="U1RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR3" edc:desc="" edc:mask="0x1" edc:name="U1RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR4" edc:desc="" edc:mask="0x1" edc:name="U1RXR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR5" edc:desc="" edc:mask="0x1" edc:name="U1RXR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1CTSR0" edc:desc="" edc:mask="0x1" edc:name="U1CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR1" edc:desc="" edc:mask="0x1" edc:name="U1CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR2" edc:desc="" edc:mask="0x1" edc:name="U1CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR3" edc:desc="" edc:mask="0x1" edc:name="U1CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR4" edc:desc="" edc:mask="0x1" edc:name="U1CTSR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR5" edc:desc="" edc:mask="0x1" edc:name="U1CTSR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR19" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR19" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXR" edc:desc="" edc:mask="0x3f" edc:name="U2RXR" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2CTSR" edc:desc="" edc:mask="0x3f" edc:name="U2CTSR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2RXR0" edc:desc="" edc:mask="0x1" edc:name="U2RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR1" edc:desc="" edc:mask="0x1" edc:name="U2RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR2" edc:desc="" edc:mask="0x1" edc:name="U2RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR3" edc:desc="" edc:mask="0x1" edc:name="U2RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR4" edc:desc="" edc:mask="0x1" edc:name="U2RXR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR5" edc:desc="" edc:mask="0x1" edc:name="U2RXR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2CTSR0" edc:desc="" edc:mask="0x1" edc:name="U2CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR1" edc:desc="" edc:mask="0x1" edc:name="U2CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR2" edc:desc="" edc:mask="0x1" edc:name="U2CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR3" edc:desc="" edc:mask="0x1" edc:name="U2CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR4" edc:desc="" edc:mask="0x1" edc:name="U2CTSR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR5" edc:desc="" edc:mask="0x1" edc:name="U2CTSR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR20" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR20" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0x3f" edc:name="SDI1R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK1R" edc:desc="" edc:mask="0x3f" edc:name="SCK1R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI1R0" edc:desc="" edc:mask="0x1" edc:name="SDI1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R1" edc:desc="" edc:mask="0x1" edc:name="SDI1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R2" edc:desc="" edc:mask="0x1" edc:name="SDI1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R3" edc:desc="" edc:mask="0x1" edc:name="SDI1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R4" edc:desc="" edc:mask="0x1" edc:name="SDI1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R5" edc:desc="" edc:mask="0x1" edc:name="SDI1R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK1R0" edc:desc="" edc:mask="0x1" edc:name="SCK1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R1" edc:desc="" edc:mask="0x1" edc:name="SCK1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R2" edc:desc="" edc:mask="0x1" edc:name="SCK1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R3" edc:desc="" edc:mask="0x1" edc:name="SCK1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R4" edc:desc="" edc:mask="0x1" edc:name="SCK1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R5" edc:desc="" edc:mask="0x1" edc:name="SCK1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
